Documents/БухгалтерскаяСправкаПоЗатратам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>БухгалтерскаяСправкаПоЗатратам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтатьиЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БухгалтерскаяСправкаПоЗатратам/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ЭтоНеРаспределяемаяУслуга(Услуга)

	Возврат Услуга.НеВключатьВРаспределение;	

КонецФункции // ЭтоНеРаспределяемаяУслуга()
 
// Процедура - обработчик события ПриИзменении поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	
	ЭтаФорма.Объект.Дата 		= КонецМесяца(ЭтаФорма.Объект.Дата);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериода	= Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.Дата= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.Дата));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.Дата = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ЭтаФорма.Объект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.Дата), 
						ДобавитьМесяц(ЭтаФорма.Объект.Дата, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаПриИзменении(Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериода = Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаВыбора поля ввода Услуга.
//
&НаКлиенте
Процедура СтатьиЗатратУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СтатьиЗатрат.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Здание) Тогда
		Если  ЭтоНеРаспределяемаяУслуга(ВыбранноеЗначение) Тогда
			ТекстСообщения = НСтр("ru='При выборе услуги не включаемой в распределение общих затрат необходимо заполнить Здание.';"
			"uk='При виборі послуги не включаємой в розподіл загальних витрат необхідно заповнити Будівлю.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры
